---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
HermiteFace..::..Triangulate Method
HermiteFace Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | Triangulate()()()() | Returns a triangular mesh approximation to the face. (Inherited from Face.) |
|  | Triangulate(Double) | Returns a triangular mesh approximation to the face. (Inherited from Face.) |

# See Also

HermiteFace Class

HermiteFace Members

Autodesk.Revit.DB Namespace